# Interacting with SQL databases

## SQL Packages
- **Pymysql**: Allows access the MySQL database server from Python.  
- **Ipython-sql**: This ipython-sql package allows you to write SQL queries into code cells using magic commands.

## Magic commands
- `%` Inline  
- `%%` Multiple Lines

## Preparing the Environment
```python

In [1]:
#Preparing sql environment
%load_ext sql

In [2]:
%sql mysql+pymysql://root:0479%40Kanya@127.0.0.1:3306/united_nations

In [3]:
%%sql
SELECT * FROM Access_to_Basic_Services LIMIT 5;

 * mysql+pymysql://root:***@127.0.0.1:3306/united_nations
5 rows affected.

[('Central and Southern Asia', 'Central Asia', 'Kazakhstan', 2015, 94.67, 98, 17.542806, 184.39, 2699700, 4.93),
 ('Central and Southern Asia', 'Central Asia', 'Kazakhstan', 2016, 94.67, 98, 17.794055, 137.28, 2699700, 4.96),
 ('Central and Southern Asia', 'Central Asia', 'Kazakhstan', 2017, 95.0, 98, 18.037776, 166.81, 2699700, 4.9),
 ('Central and Southern Asia', 'Central Asia', 'Kazakhstan', 2018, 95.0, 98, 18.276452, 179.34, 2699700, 4.85),
 ('Central and Southern Asia', 'Central Asia', 'Kazakhstan', 2019, 95.0, 98, 18.513673, 181.67, 2699700, 4.8)]

# Serverless SQL

## Chinook.db file

In [4]:
%sql sqlite:///chinook.db

In [5]:
%%sql
SELECT  
      FirstName,
      LastName,
      HireDate
FROM 
    employees;

   mysql+pymysql://root:***@127.0.0.1:3306/united_nations
 * sqlite:///chinook.db
Done.

[('Andrew', 'Adams', '2002-08-14 00:00:00'),
 ('Nancy', 'Edwards', '2002-05-01 00:00:00'),
 ('Jane', 'Peacock', '2002-04-01 00:00:00'),
 ('Margaret', 'Park', '2003-05-03 00:00:00'),
 ('Steve', 'Johnson', '2003-10-17 00:00:00'),
 ('Michael', 'Mitchell', '2003-10-17 00:00:00'),
 ('Robert', 'King', '2004-01-02 00:00:00'),
 ('Laura', 'Callahan', '2004-03-04 00:00:00')]